<?php  // lesson_9 (looping) — Loops (ပတ်ချာလည် အလုပ်လုပ်ခြင်း)

// for loop: အကြိမ်အရေအတွက် အတိအကျသိလျှင် သုံးသည်။

// ၁ ကနေ ၅ အထိ ပရင့်ထုတ်မည်

for ($i = 1; $i <= 5; $i++) {
    echo "Count: $i <br>";
}

// ================================================================================================================================

// while loop: အခြေအနေ မှန်နေသမျှ ပတ်မည်။

// while loop: စစ်တယ် -> မှန်မှ အလုပ်လုပ်တယ်။

// ================================================================================================================================

// do...while loop: အနည်းဆုံး ၁ ကြိမ် တိုင်ပတ်ပြီးမှ အခြေအနေ စစ်မည်။

$i = 1;

do {
    echo "Count is: $i <br>";
    $i++; // $i ကို ၁ စီ တိုးသွားမည်
} while ($i <= 5); 

// Output: Count is: 1
//         Count is: 2
//         Count is: 3
//         Count is: 4
//         Count is: 5

$x = 10;

do {
    echo "ဒီစာသားက Condition မှားနေပေမဲ့ ၁ ကြိမ်တော့ ပေါ်လာပါမယ်။ <br>";
    echo "x ရဲ့ တန်ဖိုး = $x";
} while ($x < 5); // 10 < 5 သည် false ဖြစ်သဖြင့် ဒီမှာတင် ရပ်သွားမည်

// Output: ဒီစာသားက Condition မှားနေပေမဲ့ ၁ ကြိမ်တော့ ပေါ်လာပါမယ်။
//         x ရဲ့ တန်ဖိုး = 10


// do...while loop: အလုပ်လုပ်တယ် -> ပြီးမှ စစ်တယ် (အနည်းဆုံး ၁ ကြိမ် အမြဲ အလုပ်လုပ်သည်)။


// foreach loop: Array ထဲရှိ Element များကို တစ်ခုချင်းစီ ထုတ်ယူရန် သုံးသည်။

$colors = ["Red", "Green", "Blue"];

foreach ($colors as $color) {
    echo "Color: $color <br>";
}

?>